golang-gin/wrk.out
Running 10s test @ http://localhost:8000/albums/
  2 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    84.66us   68.65us   2.58ms   92.70%
    Req/Sec    60.11k   844.01    62.51k    68.81%
  1207947 requests in 10.10s, 221.18MB read
Requests/sec: 119605.01
Transfer/sec:     21.90MB